{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": [],
      "gpuType": "T4",
      "toc_visible": true
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    },
    "accelerator": "GPU"
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "# Лабораторная работа №6\n",
        "\n",
        "Многопоточная программа «Hello World!» в CUDA.\n",
        "\n",
        "Напишите CUDA-программу, в которой создаётся 2 блока, содержащих\n",
        "по 2 нити, и каждая нить выводит на экран строку «Hello World!».\n",
        "Входные данные: нет.\n",
        "Выходные данные: 4 строки «Hello World!»."
      ],
      "metadata": {
        "id": "Ut3qiBJ1eyVa"
      }
    },
    {
      "cell_type": "code",
      "execution_count": 1,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "4JQvxxBub0vJ",
        "outputId": "55c9a651-cf84-4aa2-df32-42f8f0e7f8a1"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Writing hello.cu\n"
          ]
        }
      ],
      "source": [
        "%%writefile hello.cu\n",
        "#include <iostream>\n",
        "#include <cuda_runtime.h>\n",
        "\n",
        "__global__ void cHello()  // Объявление функции-ядра\n",
        "{\n",
        "    printf(\"Hello World!\\n\");\n",
        "}\n",
        "\n",
        "int main()\n",
        "{\n",
        "    cHello<<<2, 2>>>(); // Запуск ядра. 2 блока по 2 нити = 4 нити суммарно, каждая выполнит cHello - независимо\n",
        "\n",
        "    cudaError_t ce = cudaDeviceSynchronize(); // CPU ждёт пока GPU завершит все вычисления\n",
        "    if (ce != cudaSuccess)\n",
        "    {\n",
        "        printf(\"Error: %s\\n\", cudaGetErrorString(ce));\n",
        "    }\n",
        "\n",
        "    return 0;\n",
        "}"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "!nvcc hello.cu -o hello && ./hello"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "aAQdocHsem2q",
        "outputId": "6b605093-563a-4d1a-ae7e-6af2fe0a1b83"
      },
      "execution_count": 2,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "nvcc warning : Support for offline compilation for architectures prior to '<compute/sm/lto>_75' will be removed in a future release (Use -Wno-deprecated-gpu-targets to suppress warning).\n",
            "Hello World!\n",
            "Hello World!\n",
            "Hello World!\n",
            "Hello World!\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Ответы на вопросы:"
      ],
      "metadata": {
        "id": "OfsO_W5FfvxA"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "### 1. Для каких устройств предназначен стандарт CUDA?\n",
        "\n",
        "CUDA (Compute Unified Device Architecture) предназначен исключительно для графических ускорителей NVIDIA. Поддерживается начиная с серии G8x, включая линейки GeForce, Quadro и Tesla."
      ],
      "metadata": {
        "id": "JAzHh6Qjf65T"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "### 2. Какую модель параллельного программирования реализует этот стандарт?\n",
        "\n",
        "CUDA реализует модель SIMT (Single Instruction, Multiple Threads) одна инструкция выполняется одновременно множеством нитей. Это разновидность модели GPGPU (General-Purpose computing on GPU) использование видеокарты для вычислений общего назначения, не связанных с графикой."
      ],
      "metadata": {
        "id": "9uP6dW1Hf-KQ"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "### 3. Как организуется программа в стандарте CUDA?\n",
        "\n",
        "Программа состоит из двух частей:\n",
        "\n",
        "- Host-код - выполняется на CPU, обычный C/C++. Управляет памятью и запускает ядра.\n",
        "- Device-код (ядра) - выполняется на GPU, помечается квалификатором __global__.\n",
        "\n",
        "Нити организованы иерархически:\n",
        "\n",
        "- Грид (Grid) - совокупность всех блоков\n",
        "- Блок (Block) - группа нитей, имеющих общую память\n",
        "- Нить (Thread) - минимальная единица выполнения\n",
        "\n",
        "В нашей лабе: грид из 2 блоков × 2 нити = 4 нити суммарно."
      ],
      "metadata": {
        "id": "BVqOu5XKgKIC"
      }
    },
    {
      "cell_type": "markdown",
      "source": [
        "### 4. Какую роль играет команда kernel, каковы её параметры?\n",
        "\n",
        "Команда запуска ядра служит для вызова функции-ядра на GPU. Синтаксис:\n",
        "\n",
        "kernel<<<Dg, Db, Ns, S>>>(params)\n",
        "\n",
        "Параметр Dg имеет тип dim3 и задаёт размер грида — то есть количество блоков.\n",
        "\n",
        "Параметр Db также имеет тип dim3 и задаёт размер каждого блока — количество нитей в нём.\n",
        "\n",
        "Параметр Ns типа size_t является опциональным и указывает размер динамически выделяемой общей памяти.\n",
        "\n",
        "Параметр S типа cudaStream_t тоже опциональный и определяет поток, в котором запускается ядро.\n",
        "\n",
        "В нашем примере cHello<<<2, 2>>>() означает запуск ядра в 2 блоках по 2 нити в каждом, итого 4 нити."
      ],
      "metadata": {
        "id": "LQT7z0cSgaj8"
      }
    },
    {
      "cell_type": "code",
      "source": [],
      "metadata": {
        "id": "3OIB8OAEg-OY"
      },
      "execution_count": null,
      "outputs": []
    }
  ]
}